# Выполнение задания
# Модуль 3. Часть 3. Уровень 2.

def eliminate_symbols (s):
	# функция для удаления знаков препинания
	symbols = ['-', '.', '!', ',']			# знаки препинания в тексте
	c = ''
	for i in range(0, len(s)):
		if s[i] not in symbols:
			c += s[i]
	return c

def return_short_words (s, word_length):
	# функция, которая возвращает короткие слова
	# длина слова определяется аргументом word_length
	c = eliminate_symbols (s)

	word_list = c.split()
	
	short_words = []
	for word in word_list:
		if len(word) < word_length:
			short_words.append(word)
	
	return short_words


# Проверяем, как работает

s = '''Было просто пасмурно, дуло с севера
А к обеду насчитал сто градаций серого.
Так всегда первого ноль девятого
То ли весь мир сошёл с ума, то ли я - того...
На столе записка от неё смятая
Недопитый виски допиваю с матами.
Посмотрю в окно, допишу главу
Первое сентября, дворник жжёт листву.
Серым облакам наплевать на нас
Если знаешь как жить - живи
Ты хотела плыть как все - так плыви! '''

wl = 5;			# размер "длинного" слова в символах
sw = return_short_words (s, wl)
print ('Короткие слова: ', sw)