# Выполнение задания
# Модуль 4. Уровень 3.
# Поиск в ширину на графе
# 
# Выходные данные:
# visit_list - порядок посещений вершин
# parent - родители для каждой вершины кроме начальной (start)
# time - длина пути для от start до каждой вершины  
# 
# Алгоритмическая сложность: 
# по времени -- О(V+E), то есть О(V) или О(V^2) в зависимости от плотности графа; 
# по памяти  -- О(V), если граф плотный или 
#               О(1), если у каждой вершины несколько ребер,
#                     и это число не зависит от общего числа вершин
# V - число вершин графа, Е - число рёбер графа

from collections import deque

def bfs(graph, start):

    visited = set([start])              # множество для отслеживания посещённых вершин
    queue = deque([start])              # очередь для хранения вершин, подлежащих обследованию

    visit_list = []                     # список посещений вершин
    parent = {}                         # словарь родителей для построения дерева обхода
    time = {}                           # словарь времён (длин пути)

    time[start] = 0                     # начинаем!           

    while queue:                                    # Пока в очереди есть элементы
        vertex = queue.popleft()                    # извлекаем вершину из начала очереди
        visit_list.append(vertex)                   # добавляем эту вершину в список посещений

        # Перебираем всех соседей текущей вершины
        for neighbor in graph[vertex]:

            if neighbor not in visited:             # Если вершина ещё не посещена
                visited.add(neighbor)               # помечаем вершину как посещённую
                queue.append(neighbor)              # и добавляем её в конец очереди
                parent[neighbor] = vertex           # назначаем ей вершину-родителя
                time[neighbor] = time[vertex]+1     # Время обхода на 1 больше, чем у родителя 
                          

    return visit_list, parent, time


# Проверяем, как работает на неориентированном графе
graph = {'1': set(['2', '7', '8']),
         '2': set(['1', '5', '7', '3']),
         '3': set(['2', '4']),
         '4': set(['3', '5']),
         '5': set(['2', '3', '4', '6']),
         '6': set(['5']),
         '7': set(['1', '2']),
         '8': set(['1'])}

visit_list, parent, time = bfs (graph, '1')

print ('Порядок обхода вершин:', end=' ')
print (visit_list)

print ('   Длина пути (время):', end='   ')
for point in visit_list:
    print (time[point], end='    ')

print ('\nДерево обхода в ширину:')
print (parent)